const cityCoordinatesMap = {
    "مكة المكرمة": {
        "lat": 21.4225,
        "lng": 39.8262
    },
    "المدينة المنورة": {
        "lat": 24.5247,
        "lng": 39.5692
    },
    "الرياض": {
        "lat": 24.7136,
        "lng": 46.6753
    },
    "جدة": {
        "lat": 21.5433,
        "lng": 39.1728
    },
    "الدمام": {
        "lat": 26.4207,
        "lng": 50.0888
    },
    "الطائف": {
        "lat": 21.2646,
        "lng": 40.4
    },
    "تبوك": {
        "lat": 28.3835,
        "lng": 36.5662
    },
    "أبها": {
        "lat": 18.2164,
        "lng": 42.5053
    },
    "بريدة": {
        "lat": 32.3275,
        "lng": 43.9351
    },
    "الخبر": {
        "lat": 26.2844,
        "lng": 50.2104
    },
    "نجران": {
        "lat": 18.2167,
        "lng": 44.1333
    },
    "حائل": {
        "lat": 27.5218,
        "lng": 41.6907
    },
    "جيزان": {
        "lat": 16.8892,
        "lng": 42.5511
    },
    "ينبع": {
        "lat": 24.0891,
        "lng": 38.0628
    },
    "دبي": {
        "lat": 25.2048,
        "lng": 55.2708
    },
    "أبوظبي": {
        "lat": 24.4539,
        "lng": 54.3773
    },
    "الشارقة": {
        "lat": 25.3463,
        "lng": 55.4209
    },
    "عجمان": {
        "lat": 25.4052,
        "lng": 55.439
    },
    "العين": {
        "lat": 24.1917,
        "lng": 55.7606
    },
    "رأس الخيمة": {
        "lat": 25.7895,
        "lng": 55.9432
    },
    "الفجيرة": {
        "lat": 25.1288,
        "lng": 56.3265
    },
    "أم القيوين": {
        "lat": 25.5647,
        "lng": 55.5552
    },
    "القاهرة": {
        "lat": 30.0444,
        "lng": 31.2357
    },
    "الإسكندرية": {
        "lat": 31.2001,
        "lng": 29.9187
    },
    "الجيزة": {
        "lat": 30.0131,
        "lng": 31.2089
    },
    "شرم الشيخ": {
        "lat": 27.9158,
        "lng": 34.3299
    },
    "المنصورة": {
        "lat": 31.0409,
        "lng": 31.3777
    },
    "أسوان": {
        "lat": 24.0889,
        "lng": 32.8998
    },
    "الأقصر": {
        "lat": 25.6872,
        "lng": 32.6396
    },
    "طنطا": {
        "lat": 30.7865,
        "lng": 31.0004
    },
    "أسيوط": {
        "lat": 27.1809,
        "lng": 31.1836
    },
    "الإسماعيلية": {
        "lat": 30.5965,
        "lng": 32.2715
    },
    "بورسعيد": {
        "lat": 31.2653,
        "lng": 32.3019
    },
    "السويس": {
        "lat": 29.9668,
        "lng": 32.5498
    },
    "سوهاج": {
        "lat": 27.1783,
        "lng": 31.1859
    },
    "الغردقة": {
        "lat": 27.2579,
        "lng": 33.8116
    },
    "عمان": {
        "lat": 31.9454,
        "lng": 35.9284
    },
    "إربد": {
        "lat": 32.5514,
        "lng": 35.8515
    },
    "الزرقاء": {
        "lat": 32.0645,
        "lng": 36.0906
    },
    "العقبة": {
        "lat": 29.5319,
        "lng": 35.0061
    },
    "بيروت": {
        "lat": 33.8938,
        "lng": 35.5018
    },
    "طرابلس": {
        "lat": 34.4367,
        "lng": 35.8497
    },
    "صيدا": {
        "lat": 33.5571,
        "lng": 35.373
    },
    "دمشق": {
        "lat": 33.5138,
        "lng": 36.2765
    },
    "حلب": {
        "lat": 36.2021,
        "lng": 37.1343
    },
    "حمص": {
        "lat": 34.7304,
        "lng": 36.7136
    },
    "اللاذقية": {
        "lat": 35.5317,
        "lng": 35.7901
    },
    "حماة": {
        "lat": 35.1318,
        "lng": 36.7578
    },
    "القدس": {
        "lat": 31.7683,
        "lng": 35.2137
    },
    "غزة": {
        "lat": 31.5017,
        "lng": 34.4668
    },
    "رام الله": {
        "lat": 31.9029,
        "lng": 35.2062
    },
    "الخليل": {
        "lat": 31.5326,
        "lng": 35.0998
    },
    "نابلس": {
        "lat": 31.9315,
        "lng": 35.268
    },
    "بغداد": {
        "lat": 33.3152,
        "lng": 44.3661
    },
    "البصرة": {
        "lat": 30.5081,
        "lng": 47.7835
    },
    "أربيل": {
        "lat": 36.1901,
        "lng": 44.009
    },
    "النجف": {
        "lat": 32.0294,
        "lng": 44.3468
    },
    "الموصل": {
        "lat": 36.34,
        "lng": 43.13
    },
    "كربلاء": {
        "lat": 32.616,
        "lng": 44.025
    },
    "الدوحة": {
        "lat": 25.2854,
        "lng": 51.531
    },
    "الريان": {
        "lat": 25.2919,
        "lng": 51.4244
    },
    "الكويت": {
        "lat": 29.3759,
        "lng": 47.9774
    },
    "الأحمدي": {
        "lat": 29.0769,
        "lng": 48.0839
    },
    "المنامة": {
        "lat": 26.2285,
        "lng": 50.586
    },
    "المحرق": {
        "lat": 26.2572,
        "lng": 50.6119
    },
    "مسقط": {
        "lat": 23.588,
        "lng": 58.3829
    },
    "صلالة": {
        "lat": 17.0194,
        "lng": 54.0924
    },
    "صحار": {
        "lat": 24.3461,
        "lng": 56.7075
    },
    "الرباط": {
        "lat": 34.0209,
        "lng": -6.8416
    },
    "الدار البيضاء": {
        "lat": 33.5731,
        "lng": -7.5898
    },
    "مراكش": {
        "lat": 31.6295,
        "lng": -7.9811
    },
    "طنجة": {
        "lat": 35.7595,
        "lng": -5.834
    },
    "فاس": {
        "lat": 34.0331,
        "lng": -5.0003
    },
    "الجزائر": {
        "lat": 36.7538,
        "lng": 3.0588
    },
    "وهران": {
        "lat": 35.6987,
        "lng": -0.6308
    },
    "قسنطينة": {
        "lat": 36.365,
        "lng": 6.6147
    },
    "عنابة": {
        "lat": 36.9,
        "lng": 7.7667
    },
    "تونس": {
        "lat": 36.8065,
        "lng": 10.1815
    },
    "صفاقس": {
        "lat": 34.7406,
        "lng": 10.7603
    },
    "سوسة": {
        "lat": 35.8256,
        "lng": 10.6369
    },
    "بنزرت": {
        "lat": 37.2744,
        "lng": 9.8739
    },
    "طرابلس الغرب": {
        "lat": 32.8872,
        "lng": 13.1913
    },
    "بنغازي": {
        "lat": 32.115,
        "lng": 20.0886
    },
    "مصراتة": {
        "lat": 32.3783,
        "lng": 15.0925
    },
    "نواكشوط": {
        "lat": 18.0735,
        "lng": -15.9582
    },
    "الخرطوم": {
        "lat": 15.5007,
        "lng": 32.5599
    },
    "أم درمان": {
        "lat": 15.6445,
        "lng": 32.4777
    },
    "مقديشو": {
        "lat": 2.0469,
        "lng": 45.3182
    },
    "جيبوتي": {
        "lat": 11.8251,
        "lng": 42.5903
    },
    "صنعاء": {
        "lat": 15.3694,
        "lng": 44.191
    },
    "عدن": {
        "lat": 12.7985,
        "lng": 45.0355
    },
    "تعز": {
        "lat": 15.5527,
        "lng": 44.0394
    },
    "إسطنبول": {
        "lat": 41.0082,
        "lng": 28.9784
    },
    "أنقرة": {
        "lat": 39.9208,
        "lng": 32.8541
    },
    "كوالالمبور": {
        "lat": 3.139,
        "lng": 101.6869
    },
    "جاكرتا": {
        "lat": -6.2088,
        "lng": 106.8456
    },
    "كراتشي": {
        "lat": 24.8607,
        "lng": 67.0011
    },
    "إسلام آباد": {
        "lat": 33.6844,
        "lng": 73.0479
    },
    "دكا": {
        "lat": 23.8103,
        "lng": 90.4125
    },
    "لندن": {
        "lat": 51.5074,
        "lng": -0.1278
    },
    "باريس": {
        "lat": 48.8566,
        "lng": 2.3522
    },
    "برلين": {
        "lat": 52.52,
        "lng": 13.405
    },
    "مدريد": {
        "lat": 40.4168,
        "lng": -3.7038
    },
    "روما": {
        "lat": 41.9028,
        "lng": 12.4964
    },
    "أمستردام": {
        "lat": 52.3676,
        "lng": 4.9041
    },
    "موسكو": {
        "lat": 55.7558,
        "lng": 37.6173
    },
    "ستوكهولم": {
        "lat": 59.3293,
        "lng": 18.0686
    },
    "نيويورك": {
        "lat": 40.7128,
        "lng": -74.006
    },
    "واشنطن": {
        "lat": 38.9072,
        "lng": -77.0369
    },
    "لوس أنجلوس": {
        "lat": 34.0522,
        "lng": -118.2437
    },
    "شيكاغو": {
        "lat": 41.8781,
        "lng": -87.6298
    },
    "هيوستن": {
        "lat": 29.7604,
        "lng": -95.3698
    },
    "تورونتو": {
        "lat": 43.651,
        "lng": -79.347
    },
    "مونتريال": {
        "lat": 45.5017,
        "lng": -73.5673
    },
    "أوتاوا": {
        "lat": 45.4215,
        "lng": -75.6972
    },
    "سيدني": {
        "lat": -33.8688,
        "lng": 151.2093
    },
    "ملبورن": {
        "lat": -37.8136,
        "lng": 144.9631
    },
    "Mecca": {
        "lat": 21.4225,
        "lng": 39.8262
    },
    "Makkah": {
        "lat": 21.4225,
        "lng": 39.8262
    },
    "Madinah": {
        "lat": 24.5247,
        "lng": 39.5692
    },
    "Medina": {
        "lat": 24.5247,
        "lng": 39.5692
    },
    "Riyadh": {
        "lat": 24.7136,
        "lng": 46.6753
    },
    "Jeddah": {
        "lat": 21.5433,
        "lng": 39.1728
    },
    "Dammam": {
        "lat": 26.4207,
        "lng": 50.0888
    },
    "Dubai": {
        "lat": 25.2048,
        "lng": 55.2708
    },
    "Abu Dhabi": {
        "lat": 24.4539,
        "lng": 54.3773
    },
    "Sharjah": {
        "lat": 25.3463,
        "lng": 55.4209
    },
    "Cairo": {
        "lat": 30.0444,
        "lng": 31.2357
    },
    "Alexandria": {
        "lat": 31.2001,
        "lng": 29.9187
    },
    "Amman": {
        "lat": 31.9454,
        "lng": 35.9284
    },
    "Doha": {
        "lat": 25.2854,
        "lng": 51.531
    },
    "Kuwait": {
        "lat": 29.3759,
        "lng": 47.9774
    },
    "Manama": {
        "lat": 26.2285,
        "lng": 50.586
    },
    "Muscat": {
        "lat": 23.588,
        "lng": 58.3829
    },
    "Baghdad": {
        "lat": 33.3152,
        "lng": 44.3661
    },
    "Beirut": {
        "lat": 33.8938,
        "lng": 35.5018
    },
    "Damascus": {
        "lat": 33.5138,
        "lng": 36.2765
    },
    "Rabat": {
        "lat": 34.0209,
        "lng": -6.8416
    },
    "Tunis": {
        "lat": 36.8065,
        "lng": 10.1815
    },
    "Algiers": {
        "lat": 36.7538,
        "lng": 3.0588
    },
    "Tripoli": {
        "lat": 32.8872,
        "lng": 13.1913
    },
    "London": {
        "lat": 51.5074,
        "lng": -0.1278
    },
    "New York": {
        "lat": 40.7128,
        "lng": -74.006
    },
    "Paris": {
        "lat": 48.8566,
        "lng": 2.3522
    },
    "Toronto": {
        "lat": 43.651,
        "lng": -79.347
    },
    "Sydney": {
        "lat": -33.8688,
        "lng": 151.2093
    },
    "Istanbul": {
        "lat": 41.0082,
        "lng": 28.9784
    },
    "Kuala Lumpur": {
        "lat": 3.139,
        "lng": 101.6869
    },
    "Jakarta": {
        "lat": -6.2088,
        "lng": 106.8456
    }
}; 
